code-review/NRB_3471_3546/База_Стало/Reports/АнкетаВыпускаЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>АнкетаВыпускаЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦенныеБумаги</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетПоСписку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автоформирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРоссийскийАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ФИОФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/АнкетаВыпускаЦБ/Ext/ObjectModule.bsl
Функция ВернутьКонтакт(Объект, ТипКонтакта, ВидОбъектаКонтактнойИнформации, ПрефиксПоиска="")
	
	МассивВКИ = КонтактнаяИнформация.ВидыКонтактнойИнформации(ВидОбъектаКонтактнойИнформации, ТипКонтакта, ПрефиксПоиска); 
	Если Не ЗначениеЗаполнено(МассивВКИ[0]) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Объект"		, Объект);
	Запрос.УстановитьПараметр("Тип"   		, ТипКонтакта);
	Запрос.УстановитьПараметр("МассивВКИ"   , МассивВКИ);
	Запрос.УстановитьПараметр("ДатаСреза"	, ТекущаяДата());
	
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтактнаяИнформация.Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ДатаСреза,
	|			Объект = &Объект
	|				И Тип = &Тип
	|				И Вид В (&МассивВКИ)) КАК КонтактнаяИнформация";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "";
	Иначе
		Возврат РезультатЗапроса.Выгрузить()[0].Представление;
	КонецЕсли;
КонецФункции

Функция ПолучитьКонтакты(ВладелецКонтактов)
	// Определим вид КИ
	Если ТипЗнч(ВладелецКонтактов) = Тип("СправочникСсылка.ЮридическиеЛица") Тогда
		ВидОбъектаКонтактнойИнформации	= Перечисления.ВидыОбъектовКонтактнойИнформации.ЮридическиеЛица;
	Иначе
		ВидОбъектаКонтактнойИнформации	= Перечисления.ВидыОбъектовКонтактнойИнформации.ФизическиеЛица;
	КонецЕсли;
	//---
	СтруктураКонтактов				= Новый Структура;
	
	СтруктураКонтактов.Вставить("Юридиеский"	, ВернутьКонтакт(ВладелецКонтактов, Перечисления.ТипыКонтактнойИнформации.Адрес					, ВидОбъектаКонтактнойИнформации, "Юрид"));
	СтруктураКонтактов.Вставить("Фактический"	, ВернутьКонтакт(ВладелецКонтактов, Перечисления.ТипыКонтактнойИнформации.Адрес					, ВидОбъектаКонтактнойИнформации, "Факт"));
	СтруктураКонтактов.Вставить("Телефоны"		, ВернутьКонтакт(ВладелецКонтактов, Перечисления.ТипыКонтактнойИнформации.Телефон				, ВидОбъектаКонтактнойИнформации, "Телефон"));
	СтруктураКонтактов.Вставить("Факс"			, ВернутьКонтакт(ВладелецКонтактов, Перечисления.ТипыКонтактнойИнформации.Телефон				, ВидОбъектаКонтактнойИнформации, "Факс"));
	СтруктураКонтактов.Вставить("Email"			, ВернутьКонтакт(ВладелецКонтактов, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты	, ВидОбъектаКонтактнойИнформации));

	Возврат СтруктураКонтактов;
КонецФункции

Функция ВыделитьСлово(ИсходнаяСтрока)
	Буфер = СокрЛ(ИсходнаяСтрока);
	ПозицияПослПробела = Найти(Буфер, " ");

	Если ПозицияПослПробела = 0 Тогда
		ИсходнаяСтрока = "";
		Возврат Буфер;
	КонецЕсли;
	
	ВыделенноеСлово = СокрЛП(Лев(Буфер, ПозицияПослПробела));
	ИсходнаяСтрока = Сред(ИсходнаяСтрока, ПозицияПослПробела + 1);
	
	Возврат ВыделенноеСлово;
КонецФункции

Функция СформироватьОтчет() Экспорт
	СписокОбработанныхЦБ	= Новый СписокЗначений;
	ТабличныйДокумент		= Новый ТабличныйДокумент;
	Макет					= ПолучитьМакет("Макет");
	
	Для Каждого Элемент ИЗ ЦенныеБумаги Цикл
		Если Не ЗначениеЗаполнено(Элемент.Значение) ИЛИ Не СписокОбработанныхЦБ.НайтиПоЗначению(Элемент.Значение)=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		//---
		ЦеннаяБумага= Элемент.Значение;
		СписокОбработанныхЦБ.Добавить(Элемент.Значение);
		//---
		Область		= Макет.ПолучитьОбласть("Анкета");
		Параметры	= Область.Параметры;
		// Наименование выпуска ЦБ и мнемокод
		Если Не ЗначениеЗаполнено(ЦеннаяБумага.НаименованиеВыпуска) И ЦеннаяБумага.ТипЦБ = Перечисления.ТипыЦБ.ДепозитарнаяРасписка Тогда
			Параметры.НаименованиеВыпускаЦБ	= СокрЛП(ЦеннаяБумага.Наименование);		
		Иначе
			Параметры.НаименованиеВыпускаЦБ	= СокрЛП(ЦеннаяБумага.НаименованиеВыпуска);
		КонецЕсли;
		Параметры.МнемокодВыпускаЦБ	= СокрЛП(ЦеннаяБумага.Код);
		// 1. Информация об эмитенте
		Эмитент				= ЦеннаяБумага.Эмитент;
		ЭмитентЮрФизЛицо	= ?(ЗначениеЗаполнено(Эмитент.ЮридическиеФизическиеЛица), Эмитент.ЮридическиеФизическиеЛица, Справочники.ЮридическиеЛица.ПустаяСсылка());
		//---
		Если ЗначениеЗаполнено(Эмитент) Тогда
			Параметры.ЭмитентНаименование	= ?(ЗначениеЗаполнено(СокрЛП(ЭмитентЮрФизЛицо.ПолноеНаименование)), СокрЛП(ЭмитентЮрФизЛицо.ПолноеНаименование), СокрЛП(Эмитент.НаименованиеПолное));
			Параметры.ЭмитентСокращение		= ?(ЗначениеЗаполнено(СокрЛП(ЭмитентЮрФизЛицо.Наименование)), СокрЛП(ЭмитентЮрФизЛицо.Наименование), СокрЛП(Эмитент.Наименование));	
			Параметры.ЭмитентИНН			= СокрЛП(Эмитент.ИНН);
			Параметры.ЭмитентКПП			= ?(ЗначениеЗаполнено(СокрЛП(ЭмитентЮрФизЛицо.КПП)), СокрЛП(ЭмитентЮрФизЛицо.КПП), СокрЛП(Эмитент.КПП));
			Параметры.ЭмитентОГРН			= ?(ЗначениеЗаполнено(СокрЛП(ЭмитентЮрФизЛицо.ОГРН)), СокрЛП(ЭмитентЮрФизЛицо.ОГРН), СокрЛП(Эмитент.ОГРН));
			
			Если ЗначениеЗаполнено(ЭмитентЮрФизЛицо) Тогда
				
				ИнформацияПоУК = РегистрыСведений.СобственныеСредства.СрезПоследних(ТекущаяДата(), Новый Структура("ЮрЛицо", ЭмитентЮрФизЛицо));
				Параметры.ЭмитентУставныйКапитал = ?(ИнформацияПоУК.Количество()>0, ИнформацияПоУК[0].Сумма, 0);
			
				КодСтраны = СокрЛП(ЭмитентЮрФизЛицо.Страна.Код);
				Параметры.ЭмитентКодСтраны			= КодСтраны;
				Параметры.ЭмитентДатаВнесенияЕГРЮЛ	= Формат(ЭмитентЮрФизЛицо.ДатаВнесенияВЕГРЮЛ, "ДФ=dd.MM.yyyy");
				
				НеРезидент = (ЭмитентЮрФизЛицо.НеРезидент ИЛИ КодСтраны <> "643");
				Если ЗначениеЗаполнено(ЭмитентЮрФизЛицо.ИНН) Тогда
					Параметры.ЭмитентИНН = СокрЛП(ЭмитентЮрФизЛицо.ИНН);
				ИначеЕсли НеРезидент И ЗначениеЗаполнено(ЭмитентЮрФизЛицо.TIN) Тогда
					Параметры.ЭмитентИНН = СокрЛП(ЭмитентЮрФизЛицо.TIN);
				ИначеЕсли НеРезидент И ЗначениеЗаполнено(ЭмитентЮрФизЛицо.РегНомер) Тогда
					Параметры.ЭмитентИНН = СокрЛП(ЭмитентЮрФизЛицо.РегНомер);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		// 2. параметры выпуска ЦБ
		Параметры.НаименованиеВидаЦБ = ""+ЦеннаяБумага.ТипЦБ+" "+ЦеннаяБумага.ВидЦБ;
		Попытка
			НоминалЦБ = РегистрыСведений.НоминалЦБ.СрезПоследних(ТекущаяДата(), Новый Структура("ЦеннаяБумага",ЦеннаяБумага))[0].Сумма;
		Исключение
			НоминалЦБ = 0;
		КонецПопытки;
		Параметры.НоминалВалютаНоминала			= ?(НоминалЦБ>0, Формат(НоминалЦБ, "ЧЦ=20; ЧДЦ=6; ЧН=0,000000")+" "+?(СокрЛП(ЦеннаяБумага.ВалютаНоминала.Наименование)="SUR", "RUR", СокрЛП(ЦеннаяБумага.ВалютаНоминала.Наименование)), "");
		Параметры.ВалютаНоминала				= ?(СокрЛП(ЦеннаяБумага.ВалютаНоминала.Наименование)="SUR", "RUR", СокрЛП(ЦеннаяБумага.ВалютаНоминала.Наименование));
		Параметры.КодВалюты						= СокрЛП(ЦеннаяБумага.ВалютаНоминала.Код);
		Параметры.ФормаВыпускаЦБ				= ЦеннаяБумага.ФормаВыпуска;
		Параметры.НомерГосРегистрацииВыпуска	= СокрЛП(ЦеннаяБумага.НомерРегистрации);
		Параметры.ДатаВыпуска					= Формат(ЦеннаяБумага.ДатаГосРег, "ДФ=dd.MM.yyyy");
		Параметры.ДатаПервичногоРазмещения		= Формат(ЦеннаяБумага.ДатаРазмещения, "ДФ=dd.MM.yyyy");
		Параметры.ДатаПогашения					= Формат(ЦеннаяБумага.ДатаПогашения, "ДФ=dd.MM.yyyy");
		Параметры.ОбъемЭмиссии					= ЦеннаяБумага.ОбъемРазмещения;       
		Параметры.ОбъемЭмиссииПоНоминалуВалюта	= ?(ЦеннаяБумага.ОбъемРазмещения*НоминалЦБ>0, Формат(ЦеннаяБумага.ОбъемРазмещения*НоминалЦБ, "ЧЦ=20; ЧДЦ=6; ЧН=0,000000")+" "+?(СокрЛП(ЦеннаяБумага.ВалютаНоминала.Наименование)="SUR", "RUR", СокрЛП(ЦеннаяБумага.ВалютаНоминала.Наименование)), "");
		Параметры.КодISIN						= СокрЛП(ЦеннаяБумага.ISIN);
		Параметры.КодCFI						= СокрЛП(ЦеннаяБумага.CFI);
		//---
		Параметры.ДатаПриемаНаОбслуживание		= Формат(ЦеннаяБумага.ДатаПриемаНаОбслуживание, "ДФ=dd.MM.yyyy");
		Параметры.ДатаСнятияСОбслуживания		= Формат(ЦеннаяБумага.ДатаСнятияСОбслуживания, "ДФ=dd.MM.yyyy");
		//---
		Параметры.ДатаНаложенияОграничений		= Формат(ЦеннаяБумага.ДатаНаложенияОграничений, "ДФ=dd.MM.yyyy");
		Параметры.ДатаСнятияОграничений			= Формат(ЦеннаяБумага.ДатаСнятияОграничений, "ДФ=dd.MM.yyyy");
		
		Параметры.УсловияВыпуска				= "";		// Не заполняем
		Параметры.УсловияПогашения				= "";		// Не заполняем
		Параметры.Примечание					= "";		// Не заполняем
		// 3. Информация о реестродержателе
		Реестродержатели = РегистрыСведений.РегистраторыЦенныхБумаг.СрезПоследних(ТекущаяДата(), Новый Структура("ЦеннаяБумага", ЦеннаяБумага));
		Если Реестродержатели.Количество() > 0 Тогда
			Реестродержатель = Реестродержатели[0].РегистраторЦБ;
		Иначе
			Реестродержатель = Справочники.ЮридическиеЛица.ПустаяСсылка();
		КонецЕсли;
		КонтактыРеестродержателя = ПолучитьКонтакты(Реестродержатель);
		
		Параметры.РеестродержательНаименование		= Реестродержатель.ПолноеНаименование;
		Параметры.РеестродержательСокращение		= Реестродержатель.Наименование;		
		Параметры.РеестродержательЮридическийАдрес	= СокрЛП(КонтактыРеестродержателя["Юридиеский"]);
		Параметры.РеестродержательПочтовыйАдрес		= СокрЛП(КонтактыРеестродержателя["Фактический"]);
		Параметры.РеестродержательТелефоны			= СокрЛП(КонтактыРеестродержателя["Телефоны"]);
		Параметры.РеестродержательФакс				= СокрЛП(КонтактыРеестродержателя["Факс"]);
		Параметры.РеестродержательEmail				= СокрЛП(КонтактыРеестродержателя["Email"]);
		
		// Подвал (подпись / печать)
		Если ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.ФизЛицо) Тогда
			ТаблицаФИО = РегистрыСведений.ФИОФизЛиц.СрезПоследних(, Новый Структура("ФизЛицо",ПараметрыСеанса.ТекущийПользователь.ФизЛицо));
		Иначе
			ТаблицаФИО = Новый ТаблицаЗначений;
		КонецЕсли;			
		Если ТаблицаФИО.Количество() > 0 Тогда
			Фамилия	= СокрЛП(ТаблицаФИО[0].Фамилия);
			Имя		= СокрЛП(ТаблицаФИО[0].Имя);
			Отчество= СокрЛП(ТаблицаФИО[0].Отчество);
		Иначе
			ФИО 	= СокрЛП(ПараметрыСеанса.ТекущийПользователь.ПолноеНаименование());
			Фамилия	= ВыделитьСлово(ФИО);
			Имя		= ВыделитьСлово(ФИО);
			Отчество= ВыделитьСлово(ФИО);
		КонецЕсли;
		Параметры.ФИОСотрудника	= ОбщегоНазначения.ПолучитьФамилиюИмяОтчество(Фамилия, Имя, Отчество);
		Если Не ВыводитьПечать Тогда
			Область.Рисунки.Печать.Картинка	= Новый Картинка;		
		КонецЕсли;
		// Анкета заполнена - выводим
		ТабличныйДокумент.Вывести(Область);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	// Настройки табличного документа
	ТабличныйДокумент.АвтоМасштаб		= Истина;
	ТабличныйДокумент.ТолькоПросмотр	= Истина;
	//---
	Возврат ТабличныйДокумент;	
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
